bezier_coanda_opt/system/blockMeshDict
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				dictionary;
		object			blockMeshDict;
}

// ***************************************************************************** //

scale				1;

vertices
(
		(-4.8 0.0 -0.078)	//	0
		(-4.8 0.0 0.078)	//	1
		(-0.03114733564114338 -4.8 -0.078)	//	2
		(-0.03114733564114338 -4.8 0.078)	//	3
		(-0.3 0.0 -0.078)	//	4
		(-0.3 0.0 0.078)	//	5
		(-0.03152531784432404 0.0038404832321552174 -0.078)	//	6
		(-0.03152531784432404 0.0038404832321552174 0.078)	//	7
		(-0.03152531784432404 4.8 -0.078)	//	8
		(-0.03152531784432404 4.8 0.078)	//	9
		(-0.003045 4.8 -0.078)	//	10
		(-0.003045 4.8 0.078)	//	11
		(4.796952 0.0 -0.078)	//	12
		(4.796952 0.0 0.078)	//	13
		(-0.003045 -4.8 -0.078)	//	14
		(-0.003045 -4.8 0.078)	//	15
		(0.0 0.0 -0.078)	//	16
		(0.0 0.0 0.078)	//	17
		(-0.03114733564114338 -0.0038639135055789967 -0.078)	//	18
		(-0.03114733564114338 -0.0038639135055789967 0.078)	//	19
		(0.0 0.0 -0.078)	//	20
		(0.0 0.0 0.078)	//	21
		(-0.003048 0.003048 -0.078)	//	22
		(-0.003048 0.003048 0.078)	//	23
		(-0.003047 0.0032765999999999997 -0.078)	//	24
		(-0.003047 0.0032765999999999997 0.078)	//	25
		(-0.003046 0.0035813999999999998 -0.078)	//	26
		(-0.003046 0.0035813999999999998 0.078)	//	27
		(-0.03152531784432404 0.0038404832321552174 -0.078)	//	28
		(-0.03152531784432404 0.0038404832321552174 0.078)	//	29
		(-0.003048 -0.003048 -0.078)	//	30
		(-0.003048 -0.003048 0.078)	//	31
		(-0.003047 -0.0032765999999999997 -0.078)	//	32
		(-0.003047 -0.0032765999999999997 0.078)	//	33
		(-0.003046 -0.0035813999999999998 -0.078)	//	34
		(-0.003046 -0.0035813999999999998 0.078)	//	35
		(-0.03114733564114338 -0.0038639135055789967 -0.078)	//	36
		(-0.03114733564114338 -0.0038639135055789967 0.078)	//	37
);

blocks
(
		hex ( 4 28  8  0  5 29  9  1) (40 40 1) edgeGrading (((.5 .5 10) (.5 .5 0.1)) 0.1  0.1 ((.5 .5 10) (.5 .5 0.1)) 800 800 800 800 1 1 1 1) // 0
		hex (28 26 10  8 29 27 11  9) (10 40 1) simpleGrading (0.5  800  1) // 1
		hex (26 34 14 10 27 35 15 11) (50 40 1) simpleGrading ( 1  800  1) // 2
		hex (34 36  2 14 35 37  3 15) (10 40 1) simpleGrading (2  800  1) // 3
		hex (36  4  0  2 37  5  1  3) (40 40 1) edgeGrading (((.5 .5 10) (.5 .5 0.1)) 10  10 ((.5 .5 10) (.5 .5 0.1)) 800 800 800 800 1 1 1 1) // 4
		hex (24 32 34 26 25 33 35 27) (50 1 1) simpleGrading ( 1  3  1) // 5
		hex (22 30 32 24 23 31 33 25) (50 2 1) simpleGrading ( 1  2  1) // 6
);

edges
(
		arc  8  0  90.0  (0 0 1)
		arc  9  1  90.0  (0 0 1)
		arc  0  2  90.0  (0 0 1)
		arc  1  3  90.0  (0 0 1)
		arc 14 10 180.0  (0 0 1)
		arc 15 11 180.0  (0 0 1)
		arc 30 22 180.0  (0 0 1)
		arc 31 23 180.0  (0 0 1)
		arc 32 24 180.0  (0 0 1)
		arc 33 25 180.0  (0 0 1)
		arc 34 26 180.0  (0 0 1)
		arc 35 27 180.0  (0 0 1)
		spline 4 28 (
							(-2.99997142e-01  1.59911844e-04 -7.80000000e-02)
							(-0.29998592  0.00034699 -0.078     )
							(-0.29996244  0.00055971 -0.078     )
							(-0.2999229   0.00079656 -0.078     )
							(-0.29986362  0.00105605 -0.078     )
							(-0.299781    0.00133675 -0.078     )
							(-0.29967157  0.00163721 -0.078     )
							(-0.29953194  0.00195604 -0.078     )
							(-0.29935883  0.00229185 -0.078     )
							(-0.29914907  0.00264331 -0.078     )
							(-0.29889958  0.00300907 -0.078     )
							(-0.29860739  0.00338785 -0.078     )
							(-0.29826963  0.00377836 -0.078     )
							(-0.29788354  0.00417936 -0.078     )
							(-0.29744646  0.00458963 -0.078     )
							(-0.29695583  0.00500797 -0.078     )
							(-0.29640918  0.00543321 -0.078     )
							(-0.29580418  0.00586421 -0.078     )
							(-0.29513855  0.00629983 -0.078     )
							(-0.29441017  0.00673901 -0.078     )
							(-0.29361698  0.00718065 -0.078     )
							(-0.29275704  0.00762373 -0.078     )
							(-0.29182851  0.00806722 -0.078     )
							(-0.29082966  0.00851013 -0.078     )
							(-0.28975884  0.00895151 -0.078     )
							(-0.28861454  0.0093904  -0.078     )
							(-0.28739532  0.00982591 -0.078     )
							(-0.28609985  0.01025713 -0.078     )
							(-0.28472691  0.01068321 -0.078     )
							(-0.28327539  0.01110331 -0.078     )
							(-0.28174427  0.01151663 -0.078     )
							(-0.28013263  0.01192237 -0.078     )
							(-0.27843965  0.01231979 -0.078     )
							(-0.27666465  0.01270814 -0.078     )
							(-0.274807    0.01308671 -0.078     )
							(-0.2728662   0.01345484 -0.078     )
							(-0.27084186  0.01381186 -0.078     )
							(-0.26873368  0.01415713 -0.078     )
							(-0.26654146  0.01449007 -0.078     )
							(-0.26426511  0.01481009 -0.078     )
							(-0.26190465  0.01511663 -0.078     )
							(-0.25946018  0.01540918 -0.078     )
							(-0.25693193  0.01568722 -0.078     )
							(-0.25432021  0.01595029 -0.078     )
							(-0.25162545  0.01619793 -0.078     )
							(-0.24884817  0.01642972 -0.078     )
							(-0.24598901  0.01664526 -0.078     )
							(-0.24304869  0.01684419 -0.078     )
							(-0.24002804  0.01702615 -0.078     )
							(-0.23692801  0.01719082 -0.078     )
							(-0.23374963  0.01733791 -0.078     )
							(-0.23049405  0.01746715 -0.078     )
							(-0.22716251  0.01757829 -0.078     )
							(-0.22375635  0.01767112 -0.078     )
							(-0.22027704  0.01774545 -0.078     )
							(-0.21672612  0.01780111 -0.078     )
							(-0.21310526  0.01783796 -0.078     )
							(-0.2094162   0.01785589 -0.078     )
							(-0.20566082  0.0178548  -0.078     )
							(-0.20184108  0.01783463 -0.078     )
							(-0.19795904  0.01779535 -0.078     )
							(-0.19401688  0.01773694 -0.078     )
							(-0.19001687  0.01765942 -0.078     )
							(-0.18596138  0.01756283 -0.078     )
							(-0.18185291  0.01744724 -0.078     )
							(-0.17769402  0.01731273 -0.078     )
							(-0.17348741  0.01715942 -0.078     )
							(-0.16923585  0.01698746 -0.078     )
							(-0.16494225  0.01679702 -0.078     )
							(-0.1606096   0.01658828 -0.078     )
							(-0.15624099  0.01636148 -0.078     )
							(-0.15183962  0.01611685 -0.078     )
							(-0.14740879  0.01585467 -0.078     )
							(-0.14295191  0.01557523 -0.078     )
							(-0.13847249  0.01527886 -0.078     )
							(-0.13397413  0.01496591 -0.078     )
							(-0.12946055  0.01463676 -0.078     )
							(-0.12493557  0.0142918  -0.078     )
							(-0.1204031   0.01393145 -0.078     )
							(-0.11586717  0.01355618 -0.078     )
							(-0.1113319   0.01316646 -0.078     )
							(-0.10680152  0.0127628  -0.078     )
							(-0.10228035  0.01234571 -0.078     )
							(-0.09777284  0.01191577 -0.078     )
							(-0.09328352  0.01147354 -0.078     )
							(-0.08881702  0.01101965 -0.078     )
							(-0.08437809  0.01055471 -0.078     )
							(-0.07997158  0.01007939 -0.078     )
							(-0.07560242  0.00959437 -0.078     )
							(-0.07127568  0.00910036 -0.078     )
							(-0.06699649  0.0085981  -0.078     )
							(-0.06277013  0.00808834 -0.078     )
							(-0.05860194  0.00757189 -0.078     )
							(-0.05449739  0.00704954 -0.078     )
							(-0.05046205  0.00652213 -0.078     )
							(-0.04650158  0.00599054 -0.078     )
							(-0.04262174  0.00545565 -0.078     )
							(-0.03882842  0.00491838 -0.078     )
							(-0.03512758  0.00437967 -0.078     )

						)
		spline 4 36 (
							(-0.29997097 -0.00049437 -0.078     )
							(-0.29988247 -0.00099829 -0.078     )
							(-0.29973241 -0.00151047 -0.078     )
							(-0.29951883 -0.00202965 -0.078     )
							(-0.29923983 -0.0025546  -0.078     )
							(-0.29889363 -0.00308414 -0.078     )
							(-0.29847853 -0.00361708 -0.078     )
							(-0.29799292 -0.0041523  -0.078     )
							(-0.29743528 -0.00468867 -0.078     )
							(-0.2968042  -0.00522513 -0.078     )
							(-0.29609835 -0.00576061 -0.078     )
							(-0.29531648 -0.0062941  -0.078     )
							(-0.29445746 -0.00682461 -0.078     )
							(-0.29352024 -0.00735116 -0.078     )
							(-0.29250384 -0.00787284 -0.078     )
							(-0.29140742 -0.00838873 -0.078     )
							(-0.2902302  -0.00889796 -0.078     )
							(-0.2889715  -0.00939968 -0.078     )
							(-0.28763072 -0.00989308 -0.078     )
							(-0.28620737 -0.01037737 -0.078     )
							(-0.28470106 -0.01085179 -0.078     )
							(-0.28311146 -0.01131561 -0.078     )
							(-0.28143837 -0.01176815 -0.078     )
							(-0.27968165 -0.01220871 -0.078     )
							(-0.27784128 -0.01263668 -0.078     )
							(-0.27591732 -0.01305143 -0.078     )
							(-0.27390991 -0.01345238 -0.078     )
							(-0.27181931 -0.01383899 -0.078     )
							(-0.26964585 -0.01421072 -0.078     )
							(-0.26738997 -0.01456709 -0.078     )
							(-0.26505218 -0.01490763 -0.078     )
							(-0.2626331  -0.01523191 -0.078     )
							(-0.26013345 -0.01553952 -0.078     )
							(-0.25755402 -0.01583009 -0.078     )
							(-0.2548957  -0.01610327 -0.078     )
							(-0.25215949 -0.01635874 -0.078     )
							(-0.24934646 -0.01659621 -0.078     )
							(-0.24645778 -0.01681543 -0.078     )
							(-0.24349472 -0.01701617 -0.078     )
							(-0.24045863 -0.01719822 -0.078     )
							(-0.23735097 -0.01736143 -0.078     )
							(-0.23417328 -0.01750563 -0.078     )
							(-0.23092719 -0.01763074 -0.078     )
							(-0.22761443 -0.01773665 -0.078     )
							(-0.22423682 -0.01782332 -0.078     )
							(-0.22079626 -0.01789073 -0.078     )
							(-0.21729478 -0.01793888 -0.078     )
							(-0.21373446 -0.0179678  -0.078     )
							(-0.2101175  -0.01797757 -0.078     )
							(-0.20644617 -0.01796827 -0.078     )
							(-0.20272286 -0.01794002 -0.078     )
							(-0.19895004 -0.01789299 -0.078     )
							(-0.19513025 -0.01782735 -0.078     )
							(-0.19126617 -0.01774331 -0.078     )
							(-0.18736053 -0.01764112 -0.078     )
							(-0.18341617 -0.01752104 -0.078     )
							(-0.17943602 -0.01738337 -0.078     )
							(-0.17542311 -0.01722844 -0.078     )
							(-0.17138056 -0.01705662 -0.078     )
							(-0.16731157 -0.01686828 -0.078     )
							(-0.16321945 -0.01666384 -0.078     )
							(-0.15910758 -0.01644376 -0.078     )
							(-0.15497947 -0.0162085  -0.078     )
							(-0.15083868 -0.01595856 -0.078     )
							(-0.1466889 -0.0156945 -0.078    )
							(-0.14253387 -0.01541686 -0.078     )
							(-0.13837747 -0.01512624 -0.078     )
							(-0.13422365 -0.01482327 -0.078     )
							(-0.13007643 -0.01450858 -0.078     )
							(-0.12593997 -0.01418288 -0.078     )
							(-0.12181849 -0.01384686 -0.078     )
							(-0.11771631 -0.01350126 -0.078     )
							(-0.11363784 -0.01314686 -0.078     )
							(-0.1095876  -0.01278445 -0.078     )
							(-0.10557017 -0.01241487 -0.078     )
							(-0.10159024 -0.01203896 -0.078     )
							(-0.09765261 -0.01165761 -0.078     )
							(-0.09376215 -0.01127174 -0.078     )
							(-0.08992383 -0.0108823  -0.078     )
							(-0.08614271 -0.01049026 -0.078     )
							(-0.08242394 -0.01009662 -0.078     )
							(-0.07877278 -0.00970241 -0.078     )
							(-0.07519455 -0.00930871 -0.078     )
							(-0.0716947  -0.00891659 -0.078     )
							(-0.06827874 -0.00852719 -0.078     )
							(-0.0649523  -0.00814165 -0.078     )
							(-0.06172109 -0.00776116 -0.078     )
							(-0.0585909  -0.00738691 -0.078     )
							(-0.05556763 -0.00702016 -0.078     )
							(-0.05265728 -0.00666216 -0.078     )
							(-0.04986591 -0.00631422 -0.078     )
							(-0.04719971 -0.00597767 -0.078     )
							(-0.04466494 -0.00565385 -0.078     )
							(-0.04226796 -0.00534416 -0.078     )
							(-0.04001521 -0.00505001 -0.078     )
							(-0.03791325 -0.00477284 -0.078     )
							(-0.03596871 -0.00451413 -0.078     )
							(-0.03418831 -0.00427538 -0.078     )
							(-0.03257888 -0.00405812 -0.078     )

						)
		spline 5 29 (
							(-2.99997142e-01  1.59911844e-04  7.80000000e-02)
							(-0.29998592  0.00034699  0.078     )
							(-0.29996244  0.00055971  0.078     )
							(-0.2999229   0.00079656  0.078     )
							(-0.29986362  0.00105605  0.078     )
							(-0.299781    0.00133675  0.078     )
							(-0.29967157  0.00163721  0.078     )
							(-0.29953194  0.00195604  0.078     )
							(-0.29935883  0.00229185  0.078     )
							(-0.29914907  0.00264331  0.078     )
							(-0.29889958  0.00300907  0.078     )
							(-0.29860739  0.00338785  0.078     )
							(-0.29826963  0.00377836  0.078     )
							(-0.29788354  0.00417936  0.078     )
							(-0.29744646  0.00458963  0.078     )
							(-0.29695583  0.00500797  0.078     )
							(-0.29640918  0.00543321  0.078     )
							(-0.29580418  0.00586421  0.078     )
							(-0.29513855  0.00629983  0.078     )
							(-0.29441017  0.00673901  0.078     )
							(-0.29361698  0.00718065  0.078     )
							(-0.29275704  0.00762373  0.078     )
							(-0.29182851  0.00806722  0.078     )
							(-0.29082966  0.00851013  0.078     )
							(-0.28975884  0.00895151  0.078     )
							(-0.28861454  0.0093904   0.078     )
							(-0.28739532  0.00982591  0.078     )
							(-0.28609985  0.01025713  0.078     )
							(-0.28472691  0.01068321  0.078     )
							(-0.28327539  0.01110331  0.078     )
							(-0.28174427  0.01151663  0.078     )
							(-0.28013263  0.01192237  0.078     )
							(-0.27843965  0.01231979  0.078     )
							(-0.27666465  0.01270814  0.078     )
							(-0.274807    0.01308671  0.078     )
							(-0.2728662   0.01345484  0.078     )
							(-0.27084186  0.01381186  0.078     )
							(-0.26873368  0.01415713  0.078     )
							(-0.26654146  0.01449007  0.078     )
							(-0.26426511  0.01481009  0.078     )
							(-0.26190465  0.01511663  0.078     )
							(-0.25946018  0.01540918  0.078     )
							(-0.25693193  0.01568722  0.078     )
							(-0.25432021  0.01595029  0.078     )
							(-0.25162545  0.01619793  0.078     )
							(-0.24884817  0.01642972  0.078     )
							(-0.24598901  0.01664526  0.078     )
							(-0.24304869  0.01684419  0.078     )
							(-0.24002804  0.01702615  0.078     )
							(-0.23692801  0.01719082  0.078     )
							(-0.23374963  0.01733791  0.078     )
							(-0.23049405  0.01746715  0.078     )
							(-0.22716251  0.01757829  0.078     )
							(-0.22375635  0.01767112  0.078     )
							(-0.22027704  0.01774545  0.078     )
							(-0.21672612  0.01780111  0.078     )
							(-0.21310526  0.01783796  0.078     )
							(-0.2094162   0.01785589  0.078     )
							(-0.20566082  0.0178548   0.078     )
							(-0.20184108  0.01783463  0.078     )
							(-0.19795904  0.01779535  0.078     )
							(-0.19401688  0.01773694  0.078     )
							(-0.19001687  0.01765942  0.078     )
							(-0.18596138  0.01756283  0.078     )
							(-0.18185291  0.01744724  0.078     )
							(-0.17769402  0.01731273  0.078     )
							(-0.17348741  0.01715942  0.078     )
							(-0.16923585  0.01698746  0.078     )
							(-0.16494225  0.01679702  0.078     )
							(-0.1606096   0.01658828  0.078     )
							(-0.15624099  0.01636148  0.078     )
							(-0.15183962  0.01611685  0.078     )
							(-0.14740879  0.01585467  0.078     )
							(-0.14295191  0.01557523  0.078     )
							(-0.13847249  0.01527886  0.078     )
							(-0.13397413  0.01496591  0.078     )
							(-0.12946055  0.01463676  0.078     )
							(-0.12493557  0.0142918   0.078     )
							(-0.1204031   0.01393145  0.078     )
							(-0.11586717  0.01355618  0.078     )
							(-0.1113319   0.01316646  0.078     )
							(-0.10680152  0.0127628   0.078     )
							(-0.10228035  0.01234571  0.078     )
							(-0.09777284  0.01191577  0.078     )
							(-0.09328352  0.01147354  0.078     )
							(-0.08881702  0.01101965  0.078     )
							(-0.08437809  0.01055471  0.078     )
							(-0.07997158  0.01007939  0.078     )
							(-0.07560242  0.00959437  0.078     )
							(-0.07127568  0.00910036  0.078     )
							(-0.06699649  0.0085981   0.078     )
							(-0.06277013  0.00808834  0.078     )
							(-0.05860194  0.00757189  0.078     )
							(-0.05449739  0.00704954  0.078     )
							(-0.05046205  0.00652213  0.078     )
							(-0.04650158  0.00599054  0.078     )
							(-0.04262174  0.00545565  0.078     )
							(-0.03882842  0.00491838  0.078     )
							(-0.03512758  0.00437967  0.078     )

						)
		spline 5 37 (
							(-0.29997097 -0.00049437  0.078     )
							(-0.29988247 -0.00099829  0.078     )
							(-0.29973241 -0.00151047  0.078     )
							(-0.29951883 -0.00202965  0.078     )
							(-0.29923983 -0.0025546   0.078     )
							(-0.29889363 -0.00308414  0.078     )
							(-0.29847853 -0.00361708  0.078     )
							(-0.29799292 -0.0041523   0.078     )
							(-0.29743528 -0.00468867  0.078     )
							(-0.2968042  -0.00522513  0.078     )
							(-0.29609835 -0.00576061  0.078     )
							(-0.29531648 -0.0062941   0.078     )
							(-0.29445746 -0.00682461  0.078     )
							(-0.29352024 -0.00735116  0.078     )
							(-0.29250384 -0.00787284  0.078     )
							(-0.29140742 -0.00838873  0.078     )
							(-0.2902302  -0.00889796  0.078     )
							(-0.2889715  -0.00939968  0.078     )
							(-0.28763072 -0.00989308  0.078     )
							(-0.28620737 -0.01037737  0.078     )
							(-0.28470106 -0.01085179  0.078     )
							(-0.28311146 -0.01131561  0.078     )
							(-0.28143837 -0.01176815  0.078     )
							(-0.27968165 -0.01220871  0.078     )
							(-0.27784128 -0.01263668  0.078     )
							(-0.27591732 -0.01305143  0.078     )
							(-0.27390991 -0.01345238  0.078     )
							(-0.27181931 -0.01383899  0.078     )
							(-0.26964585 -0.01421072  0.078     )
							(-0.26738997 -0.01456709  0.078     )
							(-0.26505218 -0.01490763  0.078     )
							(-0.2626331  -0.01523191  0.078     )
							(-0.26013345 -0.01553952  0.078     )
							(-0.25755402 -0.01583009  0.078     )
							(-0.2548957  -0.01610327  0.078     )
							(-0.25215949 -0.01635874  0.078     )
							(-0.24934646 -0.01659621  0.078     )
							(-0.24645778 -0.01681543  0.078     )
							(-0.24349472 -0.01701617  0.078     )
							(-0.24045863 -0.01719822  0.078     )
							(-0.23735097 -0.01736143  0.078     )
							(-0.23417328 -0.01750563  0.078     )
							(-0.23092719 -0.01763074  0.078     )
							(-0.22761443 -0.01773665  0.078     )
							(-0.22423682 -0.01782332  0.078     )
							(-0.22079626 -0.01789073  0.078     )
							(-0.21729478 -0.01793888  0.078     )
							(-0.21373446 -0.0179678   0.078     )
							(-0.2101175  -0.01797757  0.078     )
							(-0.20644617 -0.01796827  0.078     )
							(-0.20272286 -0.01794002  0.078     )
							(-0.19895004 -0.01789299  0.078     )
							(-0.19513025 -0.01782735  0.078     )
							(-0.19126617 -0.01774331  0.078     )
							(-0.18736053 -0.01764112  0.078     )
							(-0.18341617 -0.01752104  0.078     )
							(-0.17943602 -0.01738337  0.078     )
							(-0.17542311 -0.01722844  0.078     )
							(-0.17138056 -0.01705662  0.078     )
							(-0.16731157 -0.01686828  0.078     )
							(-0.16321945 -0.01666384  0.078     )
							(-0.15910758 -0.01644376  0.078     )
							(-0.15497947 -0.0162085   0.078     )
							(-0.15083868 -0.01595856  0.078     )
							(-0.1466889 -0.0156945  0.078    )
							(-0.14253387 -0.01541686  0.078     )
							(-0.13837747 -0.01512624  0.078     )
							(-0.13422365 -0.01482327  0.078     )
							(-0.13007643 -0.01450858  0.078     )
							(-0.12593997 -0.01418288  0.078     )
							(-0.12181849 -0.01384686  0.078     )
							(-0.11771631 -0.01350126  0.078     )
							(-0.11363784 -0.01314686  0.078     )
							(-0.1095876  -0.01278445  0.078     )
							(-0.10557017 -0.01241487  0.078     )
							(-0.10159024 -0.01203896  0.078     )
							(-0.09765261 -0.01165761  0.078     )
							(-0.09376215 -0.01127174  0.078     )
							(-0.08992383 -0.0108823   0.078     )
							(-0.08614271 -0.01049026  0.078     )
							(-0.08242394 -0.01009662  0.078     )
							(-0.07877278 -0.00970241  0.078     )
							(-0.07519455 -0.00930871  0.078     )
							(-0.0716947  -0.00891659  0.078     )
							(-0.06827874 -0.00852719  0.078     )
							(-0.0649523  -0.00814165  0.078     )
							(-0.06172109 -0.00776116  0.078     )
							(-0.0585909  -0.00738691  0.078     )
							(-0.05556763 -0.00702016  0.078     )
							(-0.05265728 -0.00666216  0.078     )
							(-0.04986591 -0.00631422  0.078     )
							(-0.04719971 -0.00597767  0.078     )
							(-0.04466494 -0.00565385  0.078     )
							(-0.04226796 -0.00534416  0.078     )
							(-0.04001521 -0.00505001  0.078     )
							(-0.03791325 -0.00477284  0.078     )
							(-0.03596871 -0.00451413  0.078     )
							(-0.03418831 -0.00427538  0.078     )
							(-0.03257888 -0.00405812  0.078     )

						)
);

boundary
(
    inOut
    {
        type patch;
        faces
        (
            ( 8  0  1  9)
            ( 0  2  3  1)
            (14 10 11 15)
            ( 2 14 15  3)
            (10  8  9 11)
        );
    }

    coandaUpper
    {
        type patch;
        faces
        (
            (24 22 23 25)
        );
    }

    coandaLower
    {
        type patch;
        faces
        (
            (30 32 33 31)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 4 28 29  5)
            ( 4 36 37  5)
            (28 26 27 29)
            (26 24 25 27)
            (22 30 31 23)
            (32 34 35 33)
            (34 36 37 35)
        );
    }


);
