bezier_coanda_opt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inOut
    {
        type            patch;
        nFaces          150;
        startFace       12147;
    }
    coandaUpper
    {
        type            patch;
        nFaces          2;
        startFace       12297;
    }
    coandaLower
    {
        type            patch;
        nFaces          2;
        startFace       12299;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          152;
        startFace       12301;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12300;
        startFace       12453;
    }
)

// ************************************************************************* //
