bezier_coanda_opt/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField uniform 0.15158601621686618;

boundaryField

{
    surface
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    inOut
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    coandaLower
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    coandaUpper
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
