bezier_coanda_opt/system/system_steady/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(nuTilda)   $limited;
}

divSchemes
{
    default           none;

    turbulence        bounded Gauss upwind;
    energy            bounded Gauss linearUpwind limited;

    div(phi,U)        bounded Gauss linearUpwind limited;
    div(phi,nuTilda)  $turbulence;
    div(phi,Ekp)      $energy;
    div(phi,e)        $energy;
    div(phi,K)        $energy;


    div(phid,p)     Gauss upwind;
    div((phi|interpolate(rho)),p)  bounded Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.333;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.333;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
